SkydiverMCU/mcu-iap-demo/Cortex-M0+/MM32G0005/MM32G0005_Bootloader/Device/MM32G0005/Include/reg_tim.h
/**
  * @brief TIM_RCR Register Bit Definition
  */
#define  TIM_RCR_REP_Pos                          (0)
#define  TIM_RCR_REP_Msk                          (0xFFU << TIM_RCR_REP_Pos)                        /*!<Repeat counter value*/
#define  TIM_RCR_REP                              TIM_RCR_REP_Msk
#define  TIM_RCR_REP_Bit0                         (0x01U << TIM_RCR_REP_Pos) 
#define  TIM_RCR_REP_Bit1                         (0x02U << TIM_RCR_REP_Pos) 
#define  TIM_RCR_REP_Bit2                         (0x04U << TIM_RCR_REP_Pos) 
#define  TIM_RCR_REP_Bit3                         (0x08U << TIM_RCR_REP_Pos) 
#define  TIM_RCR_REP_Bit4                         (0x10U << TIM_RCR_REP_Pos) 
#define  TIM_RCR_REP_Bit5                         (0x20U << TIM_RCR_REP_Pos) 
#define  TIM_RCR_REP_Bit6                         (0x40U << TIM_RCR_REP_Pos) 
#define  TIM_RCR_REP_Bit7                         (0x80U << TIM_RCR_REP_Pos) 
#define  TIM_RCR_REP_CNT_Pos                      (8)
#define  TIM_RCR_REP_CNT_Msk                      (0xFFU << TIM_RCR_REP_CNT_Pos)                    /*!<Real-time value written by the repeat counter*/
#define  TIM_RCR_REP_CNT                          TIM_RCR_REP_CNT_Msk
#define  TIM_RCR_REP_CNT_Bit0                     (0x01U << TIM_RCR_REP_CNT_Pos) 
#define  TIM_RCR_REP_CNT_Bit1                     (0x02U << TIM_RCR_REP_CNT_Pos) 
#define  TIM_RCR_REP_CNT_Bit2                     (0x04U << TIM_RCR_REP_CNT_Pos) 
#define  TIM_RCR_REP_CNT_Bit3                     (0x08U << TIM_RCR_REP_CNT_Pos) 
#define  TIM_RCR_REP_CNT_Bit4                     (0x10U << TIM_RCR_REP_CNT_Pos) 
#define  TIM_RCR_REP_CNT_Bit5                     (0x20U << TIM_RCR_REP_CNT_Pos) 
#define  TIM_RCR_REP_CNT_Bit6                     (0x40U << TIM_RCR_REP_CNT_Pos) 
#define  TIM_RCR_REP_CNT_Bit7                     (0x80U << TIM_RCR_REP_CNT_Pos) 

/**
  * @brief TIM_CCR1 Register Bit Definition
  */
#define  TIM_CCR1_CCR1_Pos                        (0)
#define  TIM_CCR1_CCR1_Msk                        (0xFFFFU << TIM_CCR1_CCR1_Pos)                    /*!<Channel 1 capture/compare value*/
#define  TIM_CCR1_CCR1                            TIM_CCR1_CCR1_Msk
#define  TIM_CCR1_CCR1_Bit0                       (0x0001U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_Bit1                       (0x0002U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_Bit2                       (0x0004U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_Bit3                       (0x0008U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_Bit4                       (0x0010U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_Bit5                       (0x0020U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_Bit6                       (0x0040U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_Bit7                       (0x0080U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_Bit8                       (0x0100U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_Bit9                       (0x0200U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_Bit10                      (0x0400U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_Bit11                      (0x0800U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_Bit12                      (0x1000U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_Bit13                      (0x2000U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_Bit14                      (0x4000U << TIM_CCR1_CCR1_Pos) 
#define  TIM_CCR1_CCR1_Bit15                      (0x8000U << TIM_CCR1_CCR1_Pos) 

/**
  * @brief TIM_CCR2 Register Bit Definition
  */
#define  TIM_CCR2_CCR2_Pos                        (0)
#define  TIM_CCR2_CCR2_Msk                        (0xFFFFU << TIM_CCR2_CCR2_Pos)                    /*!<Channel 2 capture/compare value*/
#define  TIM_CCR2_CCR2                            TIM_CCR2_CCR2_Msk
#define  TIM_CCR2_CCR2_Bit0                       (0x0001U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_Bit1                       (0x0002U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_Bit2                       (0x0004U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_Bit3                       (0x0008U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_Bit4                       (0x0010U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_Bit5                       (0x0020U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_Bit6                       (0x0040U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_Bit7                       (0x0080U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_Bit8                       (0x0100U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_Bit9                       (0x0200U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_Bit10                      (0x0400U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_Bit11                      (0x0800U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_Bit12                      (0x1000U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_Bit13                      (0x2000U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_Bit14                      (0x4000U << TIM_CCR2_CCR2_Pos) 
#define  TIM_CCR2_CCR2_Bit15                      (0x8000U << TIM_CCR2_CCR2_Pos) 

/**
  * @brief TIM_CCR3 Register Bit Definition
  */
#define  TIM_CCR3_CCR3_Pos                        (0)
#define  TIM_CCR3_CCR3_Msk                        (0xFFFFU << TIM_CCR3_CCR3_Pos)                    /*!<Channel 3 capture/compare value*/
#define  TIM_CCR3_CCR3                            TIM_CCR3_CCR3_Msk
#define  TIM_CCR3_CCR3_Bit0                       (0x0001U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_Bit1                       (0x0002U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_Bit2                       (0x0004U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_Bit3                       (0x0008U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_Bit4                       (0x0010U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_Bit5                       (0x0020U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_Bit6                       (0x0040U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_Bit7                       (0x0080U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_Bit8                       (0x0100U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_Bit9                       (0x0200U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_Bit10                      (0x0400U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_Bit11                      (0x0800U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_Bit12                      (0x1000U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_Bit13                      (0x2000U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_Bit14                      (0x4000U << TIM_CCR3_CCR3_Pos) 
#define  TIM_CCR3_CCR3_Bit15                      (0x8000U << TIM_CCR3_CCR3_Pos) 

/**
  * @brief TIM_CCR4 Register Bit Definition
  */
#define  TIM_CCR4_CCR4_Pos                        (0)
#define  TIM_CCR4_CCR4_Msk                        (0xFFFFU << TIM_CCR4_CCR4_Pos)                    /*!<Channel 4 capture/compare value*/
#define  TIM_CCR4_CCR4                            TIM_CCR4_CCR4_Msk
#define  TIM_CCR4_CCR4_Bit0                       (0x0001U << TIM_CCR4_CCR4_Pos) 
#define  TIM_CCR4_CCR4_Bit1                       (0x0002U << TIM_CCR4_CCR4_Pos) 
#define  TIM_CCR4_CCR4_Bit2                       (0x0004U << TIM_CCR4_CCR4_Pos) 
#define  TIM_CCR4_CCR4_Bit3                       (0x0008U << TIM_CCR4_CCR4_Pos) 
#define  TIM_CCR4_CCR4_Bit4                       (0x0010U << TIM_CCR4_CCR4_Pos) 
#define  TIM_CCR4_CCR4_Bit5                       (0x0020U << TIM_CCR4_CCR4_Pos) 
#define  TIM_CCR4_CCR4_Bit6                       (0x0040U << TIM_CCR4_CCR4_Pos) 
#define  TIM_CCR4_CCR4_Bit7                       (0x0080U << TIM_CCR4_CCR4_Pos) 
#define  TIM_CCR4_CCR4_Bit8                       (0x0100U << TIM_CCR4_CCR4_Pos) 
#define  TIM_CCR4_CCR4_Bit9                       (0x0200U << TIM_CCR4_CCR4_Pos) 
#define  TIM_CCR4_CCR4_Bit10                      (0x0400U << TIM_CCR4_CCR4_Pos) 
#define  TIM_CCR4_CCR4_Bit11                      (0x0800U << TIM_CCR4_CCR4_Pos) 
#define  TIM_CCR4_CCR4_Bit12                      (0x1000U << TIM_CCR4_CCR4_Pos) 
#define  TIM_CCR4_CCR4_Bit13                      (0x2000U << TIM_CCR4_CCR4_Pos) 
#define  TIM_CCR4_CCR4_Bit14                      (0x4000U << TIM_CCR4_CCR4_Pos) 
#define  TIM_CCR4_CCR4_Bit15                      (0x8000U << TIM_CCR4_CCR4_Pos) 

/**
  * @brief TIM_BDTR Register Bit Definition
  */
#define  TIM_BDTR_DTG_Pos                         (0)
#define  TIM_BDTR_DTG_Msk                         (0xFFU << TIM_BDTR_DTG_Pos)                       /*!<Dead-time generator setup adjustment*/
#define  TIM_BDTR_DTG                             TIM_BDTR_DTG_Msk
#define  TIM_BDTR_DTG_Bit0                        (0x01U << TIM_BDTR_DTG_Pos) 
#define  TIM_BDTR_DTG_Bit1                        (0x02U << TIM_BDTR_DTG_Pos) 
#define  TIM_BDTR_DTG_Bit2                        (0x04U << TIM_BDTR_DTG_Pos) 
#define  TIM_BDTR_DTG_Bit3                        (0x08U << TIM_BDTR_DTG_Pos) 
#define  TIM_BDTR_DTG_Bit4                        (0x10U << TIM_BDTR_DTG_Pos) 
#define  TIM_BDTR_DTG_Bit5                        (0x20U << TIM_BDTR_DTG_Pos) 
#define  TIM_BDTR_DTG_Bit6                        (0x40U << TIM_BDTR_DTG_Pos) 
#define  TIM_BDTR_DTG_Bit7                        (0x80U << TIM_BDTR_DTG_Pos) 
#define  TIM_BDTR_LOCK_Pos                        (8)
#define  TIM_BDTR_LOCK_Msk                        (0x3U << TIM_BDTR_LOCK_Pos)                       /*!<Lock configuration*/
#define  TIM_BDTR_LOCK                            TIM_BDTR_LOCK_Msk
#define  TIM_BDTR_LOCK_Bit0                       (0x1U << TIM_BDTR_LOCK_Pos) 
#define  TIM_BDTR_LOCK_Bit1                       (0x2U << TIM_BDTR_LOCK_Pos) 
#define  TIM_BDTR_OSSI_Pos                        (10)
#define  TIM_BDTR_OSSI_Msk                        (0x1U << TIM_BDTR_OSSI_Pos)                       /*!<Off state selection in the idle mode*/
#define  TIM_BDTR_OSSI                            TIM_BDTR_OSSI_Msk
#define  TIM_BDTR_OSSR_Pos                        (11)
#define  TIM_BDTR_OSSR_Msk                        (0x1U << TIM_BDTR_OSSR_Pos)                       /*!<Off state selection in the run mode*/
#define  TIM_BDTR_OSSR                            TIM_BDTR_OSSR_Msk
#define  TIM_BDTR_BKE_Pos                         (12)
#define  TIM_BDTR_BKE_Msk                         (0x1U << TIM_BDTR_BKE_Pos)                        /*!<Break function enable*/
#define  TIM_BDTR_BKE                             TIM_BDTR_BKE_Msk
#define  TIM_BDTR_BKP_Pos                         (13)
#define  TIM_BDTR_BKP_Msk                         (0x1U << TIM_BDTR_BKP_Pos)                        /*!<Break input polarity*/
#define  TIM_BDTR_BKP                             TIM_BDTR_BKP_Msk
#define  TIM_BDTR_AOE_Pos                         (14)
#define  TIM_BDTR_AOE_Msk                         (0x1U << TIM_BDTR_AOE_Pos)                        /*!<Auto output enable*/
#define  TIM_BDTR_AOE                             TIM_BDTR_AOE_Msk
#define  TIM_BDTR_MOE_Pos                         (15)
#define  TIM_BDTR_MOE_Msk                         (0x1U << TIM_BDTR_MOE_Pos)                        /*!<Main output enable*/
#define  TIM_BDTR_MOE                             TIM_BDTR_MOE_Msk
#define  TIM_BDTR_DOE_Pos                         (16)
#define  TIM_BDTR_DOE_Msk                         (0x1U << TIM_BDTR_DOE_Pos)                        /*!<Direct output enable*/
#define  TIM_BDTR_DOE                             TIM_BDTR_DOE_Msk

/**
  * @brief TIM_OR Register Bit Definition
  */
#define  TIM_OR_ETR_RMP_Pos                       (0)
#define  TIM_OR_ETR_RMP_Msk                       (0x3U << TIM_OR_ETR_RMP_Pos)                      /*!<ETR multiplex*/
#define  TIM_OR_ETR_RMP                           TIM_OR_ETR_RMP_Msk
#define  TIM_OR_ETR_RMP_Bit0                      (0x1U << TIM_OR_ETR_RMP_Pos) 
#define  TIM_OR_ETR_RMP_Bit1                      (0x2U << TIM_OR_ETR_RMP_Pos) 
#define  TIM_OR_TI4_RMP_Pos                       (6)
#define  TIM_OR_TI4_RMP_Msk                       (0x3U << TIM_OR_TI4_RMP_Pos)                      /*!<*/
#define  TIM_OR_TI4_RMP                           TIM_OR_TI4_RMP_Msk
#define  TIM_OR_TI4_RMP_Bit0                      (0x1U << TIM_OR_TI4_RMP_Pos) 
#define  TIM_OR_TI4_RMP_Bit1                      (0x2U << TIM_OR_TI4_RMP_Pos) 

/**
  * @brief TIM_CCMR3 Register Bit Definition
  */
#define  TIM_CCMR3_OC5PE_Pos                      (3)
#define  TIM_CCMR3_OC5PE_Msk                      (0x1U << TIM_CCMR3_OC5PE_Pos)                     /*!<Output compare 5 preload enable*/
#define  TIM_CCMR3_OC5PE                          TIM_CCMR3_OC5PE_Msk

/**
  * @brief TIM_CCR5 Register Bit Definition
  */
#define  TIM_CCR5_CCR5_Pos                        (0)
#define  TIM_CCR5_CCR5_Msk                        (0xFFFFU << TIM_CCR5_CCR5_Pos)                    /*!<Compare 5 value*/
#define  TIM_CCR5_CCR5                            TIM_CCR5_CCR5_Msk
#define  TIM_CCR5_CCR5_Bit0                       (0x0001U << TIM_CCR5_CCR5_Pos) 
#define  TIM_CCR5_CCR5_Bit1                       (0x0002U << TIM_CCR5_CCR5_Pos) 
#define  TIM_CCR5_CCR5_Bit2                       (0x0004U << TIM_CCR5_CCR5_Pos) 
#define  TIM_CCR5_CCR5_Bit3                       (0x0008U << TIM_CCR5_CCR5_Pos) 
#define  TIM_CCR5_CCR5_Bit4                       (0x0010U << TIM_CCR5_CCR5_Pos) 
#define  TIM_CCR5_CCR5_Bit5                       (0x0020U << TIM_CCR5_CCR5_Pos) 
#define  TIM_CCR5_CCR5_Bit6                       (0x0040U << TIM_CCR5_CCR5_Pos) 
#define  TIM_CCR5_CCR5_Bit7                       (0x0080U << TIM_CCR5_CCR5_Pos) 
#define  TIM_CCR5_CCR5_Bit8                       (0x0100U << TIM_CCR5_CCR5_Pos) 
#define  TIM_CCR5_CCR5_Bit9                       (0x0200U << TIM_CCR5_CCR5_Pos) 
#define  TIM_CCR5_CCR5_Bit10                      (0x0400U << TIM_CCR5_CCR5_Pos) 
#define  TIM_CCR5_CCR5_Bit11                      (0x0800U << TIM_CCR5_CCR5_Pos) 
#define  TIM_CCR5_CCR5_Bit12                      (0x1000U << TIM_CCR5_CCR5_Pos) 
#define  TIM_CCR5_CCR5_Bit13                      (0x2000U << TIM_CCR5_CCR5_Pos) 
#define  TIM_CCR5_CCR5_Bit14                      (0x4000U << TIM_CCR5_CCR5_Pos) 
#define  TIM_CCR5_CCR5_Bit15                      (0x8000U << TIM_CCR5_CCR5_Pos) 

/**
  * @brief TIM_PDER Register Bit Definition
  */
#define  TIM_PDER_CCDREPE_Pos                     (0)
#define  TIM_PDER_CCDREPE_Msk                     (0x1U << TIM_PDER_CCDREPE_Pos)                    /*!<Enable DMA will generate the update request at each underflow or overflow*/
#define  TIM_PDER_CCDREPE                         TIM_PDER_CCDREPE_Msk
#define  TIM_PDER_CCR1_SHIFT_EN_Pos               (1)
#define  TIM_PDER_CCR1_SHIFT_EN_Msk               (0x1U << TIM_PDER_CCR1_SHIFT_EN_Pos)              /*!<Enable channel 1 output PWM phase shift bit*/
#define  TIM_PDER_CCR1_SHIFT_EN                   TIM_PDER_CCR1_SHIFT_EN_Msk
#define  TIM_PDER_CCR2_SHIFT_EN_Pos               (2)
#define  TIM_PDER_CCR2_SHIFT_EN_Msk               (0x1U << TIM_PDER_CCR2_SHIFT_EN_Pos)              /*!<Enable channel 2 output PWM phase shift bit*/
#define  TIM_PDER_CCR2_SHIFT_EN                   TIM_PDER_CCR2_SHIFT_EN_Msk
#define  TIM_PDER_CCR3_SHIFT_EN_Pos               (3)
#define  TIM_PDER_CCR3_SHIFT_EN_Msk               (0x1U << TIM_PDER_CCR3_SHIFT_EN_Pos)              /*!<Enable channel 3 output PWM phase shift bit*/
#define  TIM_PDER_CCR3_SHIFT_EN                   TIM_PDER_CCR3_SHIFT_EN_Msk
#define  TIM_PDER_CNTFORCECL_Pos                  (8)
#define  TIM_PDER_CNTFORCECL_Msk                  (0x1U << TIM_PDER_CNTFORCECL_Pos)                 /*!<*/
#define  TIM_PDER_CNTFORCECL                      TIM_PDER_CNTFORCECL_Msk
#define  TIM_PDER_CCR1FALLRS_Pos                  (9)
#define  TIM_PDER_CCR1FALLRS_Msk                  (0x1U << TIM_PDER_CCR1FALLRS_Pos)                 /*!<*/
#define  TIM_PDER_CCR1FALLRS                      TIM_PDER_CCR1FALLRS_Msk
#define  TIM_PDER_CCR2FALLRS_Pos                  (10)
#define  TIM_PDER_CCR2FALLRS_Msk                  (0x1U << TIM_PDER_CCR2FALLRS_Pos)                 /*!<*/
#define  TIM_PDER_CCR2FALLRS                      TIM_PDER_CCR2FALLRS_Msk
#define  TIM_PDER_CCR3FALLRS_Pos                  (11)
#define  TIM_PDER_CCR3FALLRS_Msk                  (0x1U << TIM_PDER_CCR3FALLRS_Pos)                 /*!<*/
#define  TIM_PDER_CCR3FALLRS                      TIM_PDER_CCR3FALLRS_Msk

