SkydiverMCU/mcu-iap-demo/Cortex-M0+/MM32G0005/MM32G0005_Bootloader/Device/MM32G0005/Include/reg_tim.h
/**
  * @brief TIM_CCRFALL Register Bit Definition
  */
#define  TIM_CCR1FALL_CCR1FALL_Pos                (0)
#define  TIM_CCR1FALL_CCR1FALL_Msk                (0xFFFFU << TIM_CCR1FALL_CCR1FALL_Pos) 
#define  TIM_CCR1FALL_CCR1FALL                    TIM_CCR1FALL_CCR1FALL_Msk                         /*!<Channel x compare value during count down in PWM central alignment mode.PWM phase shift function: Enable PDER register PWM phase shift. According to the required phase shift, configure CCR1FALL and CCRx, PWM exports programmable phase shift waveform, and can shift left or right.*/
#define  TIM_CCR1FALL_CCR1FALL_Bit0               (0x0001U << TIM_CCR1FALL_CCR1FALL_Pos) 
#define  TIM_CCR1FALL_CCR1FALL_Bit1               (0x0002U << TIM_CCR1FALL_CCR1FALL_Pos) 
#define  TIM_CCR1FALL_CCR1FALL_Bit2               (0x0004U << TIM_CCR1FALL_CCR1FALL_Pos) 
#define  TIM_CCR1FALL_CCR1FALL_Bit3               (0x0008U << TIM_CCR1FALL_CCR1FALL_Pos) 
#define  TIM_CCR1FALL_CCR1FALL_Bit4               (0x0010U << TIM_CCR1FALL_CCR1FALL_Pos) 
#define  TIM_CCR1FALL_CCR1FALL_Bit5               (0x0020U << TIM_CCR1FALL_CCR1FALL_Pos) 
#define  TIM_CCR1FALL_CCR1FALL_Bit6               (0x0040U << TIM_CCR1FALL_CCR1FALL_Pos) 
#define  TIM_CCR1FALL_CCR1FALL_Bit7               (0x0080U << TIM_CCR1FALL_CCR1FALL_Pos) 
#define  TIM_CCR1FALL_CCR1FALL_Bit8               (0x0100U << TIM_CCR1FALL_CCR1FALL_Pos) 
#define  TIM_CCR1FALL_CCR1FALL_Bit9               (0x0200U << TIM_CCR1FALL_CCR1FALL_Pos) 
#define  TIM_CCR1FALL_CCR1FALL_Bit10              (0x0400U << TIM_CCR1FALL_CCR1FALL_Pos) 
#define  TIM_CCR1FALL_CCR1FALL_Bit11              (0x0800U << TIM_CCR1FALL_CCR1FALL_Pos) 
#define  TIM_CCR1FALL_CCR1FALL_Bit12              (0x1000U << TIM_CCR1FALL_CCR1FALL_Pos) 
#define  TIM_CCR1FALL_CCR1FALL_Bit13              (0x2000U << TIM_CCR1FALL_CCR1FALL_Pos) 
#define  TIM_CCR1FALL_CCR1FALL_Bit14              (0x4000U << TIM_CCR1FALL_CCR1FALL_Pos) 
#define  TIM_CCR1FALL_CCR1FALL_Bit15              (0x8000U << TIM_CCR1FALL_CCR1FALL_Pos) 
#define  TIM_CCR2FALL_CCR2FALL_Pos                (0)
#define  TIM_CCR2FALL_CCR2FALL_Msk                (0xFFFFU << TIM_CCR2FALL_CCR2FALL_Pos) 
#define  TIM_CCR2FALL_CCR2FALL                    TIM_CCR2FALL_CCR2FALL_Msk                         /*!<Channel x compare value during count down in PWM central alignment mode.PWM phase shift function: Enable PDER register PWM phase shift. According to the required phase shift, configure CCR2FALL and CCRx, PWM exports programmable phase shift waveform, and can shift left or right.*/
#define  TIM_CCR2FALL_CCR2FALL_Bit0               (0x0001U << TIM_CCR2FALL_CCR2FALL_Pos) 
#define  TIM_CCR2FALL_CCR2FALL_Bit1               (0x0002U << TIM_CCR2FALL_CCR2FALL_Pos) 
#define  TIM_CCR2FALL_CCR2FALL_Bit2               (0x0004U << TIM_CCR2FALL_CCR2FALL_Pos) 
#define  TIM_CCR2FALL_CCR2FALL_Bit3               (0x0008U << TIM_CCR2FALL_CCR2FALL_Pos) 
#define  TIM_CCR2FALL_CCR2FALL_Bit4               (0x0010U << TIM_CCR2FALL_CCR2FALL_Pos) 
#define  TIM_CCR2FALL_CCR2FALL_Bit5               (0x0020U << TIM_CCR2FALL_CCR2FALL_Pos) 
#define  TIM_CCR2FALL_CCR2FALL_Bit6               (0x0040U << TIM_CCR2FALL_CCR2FALL_Pos) 
#define  TIM_CCR2FALL_CCR2FALL_Bit7               (0x0080U << TIM_CCR2FALL_CCR2FALL_Pos) 
#define  TIM_CCR2FALL_CCR2FALL_Bit8               (0x0100U << TIM_CCR2FALL_CCR2FALL_Pos) 
#define  TIM_CCR2FALL_CCR2FALL_Bit9               (0x0200U << TIM_CCR2FALL_CCR2FALL_Pos) 
#define  TIM_CCR2FALL_CCR2FALL_Bit10              (0x0400U << TIM_CCR2FALL_CCR2FALL_Pos) 
#define  TIM_CCR2FALL_CCR2FALL_Bit11              (0x0800U << TIM_CCR2FALL_CCR2FALL_Pos) 
#define  TIM_CCR2FALL_CCR2FALL_Bit12              (0x1000U << TIM_CCR2FALL_CCR2FALL_Pos) 
#define  TIM_CCR2FALL_CCR2FALL_Bit13              (0x2000U << TIM_CCR2FALL_CCR2FALL_Pos) 
#define  TIM_CCR2FALL_CCR2FALL_Bit14              (0x4000U << TIM_CCR2FALL_CCR2FALL_Pos) 
#define  TIM_CCR2FALL_CCR2FALL_Bit15              (0x8000U << TIM_CCR2FALL_CCR2FALL_Pos) 
#define  TIM_CCR3FALL_CCR3FALL_Pos                (0)
#define  TIM_CCR3FALL_CCR3FALL_Msk                (0xFFFFU << TIM_CCR3FALL_CCR3FALL_Pos) 
#define  TIM_CCR3FALL_CCR3FALL                    TIM_CCR3FALL_CCR3FALL_Msk                         /*!<Channel x compare value during count down in PWM central alignment mode.PWM phase shift function: Enable PDER register PWM phase shift. According to the required phase shift, configure CCR3FALL and CCRx, PWM exports programmable phase shift waveform, and can shift left or right.*/
#define  TIM_CCR3FALL_CCR3FALL_Bit0               (0x0001U << TIM_CCR3FALL_CCR3FALL_Pos) 
#define  TIM_CCR3FALL_CCR3FALL_Bit1               (0x0002U << TIM_CCR3FALL_CCR3FALL_Pos) 
#define  TIM_CCR3FALL_CCR3FALL_Bit2               (0x0004U << TIM_CCR3FALL_CCR3FALL_Pos) 
#define  TIM_CCR3FALL_CCR3FALL_Bit3               (0x0008U << TIM_CCR3FALL_CCR3FALL_Pos) 
#define  TIM_CCR3FALL_CCR3FALL_Bit4               (0x0010U << TIM_CCR3FALL_CCR3FALL_Pos) 
#define  TIM_CCR3FALL_CCR3FALL_Bit5               (0x0020U << TIM_CCR3FALL_CCR3FALL_Pos) 
#define  TIM_CCR3FALL_CCR3FALL_Bit6               (0x0040U << TIM_CCR3FALL_CCR3FALL_Pos) 
#define  TIM_CCR3FALL_CCR3FALL_Bit7               (0x0080U << TIM_CCR3FALL_CCR3FALL_Pos) 
#define  TIM_CCR3FALL_CCR3FALL_Bit8               (0x0100U << TIM_CCR3FALL_CCR3FALL_Pos) 
#define  TIM_CCR3FALL_CCR3FALL_Bit9               (0x0200U << TIM_CCR3FALL_CCR3FALL_Pos) 
#define  TIM_CCR3FALL_CCR3FALL_Bit10              (0x0400U << TIM_CCR3FALL_CCR3FALL_Pos) 
#define  TIM_CCR3FALL_CCR3FALL_Bit11              (0x0800U << TIM_CCR3FALL_CCR3FALL_Pos) 
#define  TIM_CCR3FALL_CCR3FALL_Bit12              (0x1000U << TIM_CCR3FALL_CCR3FALL_Pos) 
#define  TIM_CCR3FALL_CCR3FALL_Bit13              (0x2000U << TIM_CCR3FALL_CCR3FALL_Pos) 
#define  TIM_CCR3FALL_CCR3FALL_Bit14              (0x4000U << TIM_CCR3FALL_CCR3FALL_Pos) 
#define  TIM_CCR3FALL_CCR3FALL_Bit15              (0x8000U << TIM_CCR3FALL_CCR3FALL_Pos) 
#define  TIM_CCR4FALL_CCR4FALL_Pos                (0)
#define  TIM_CCR4FALL_CCR4FALL_Msk                (0xFFFFU << TIM_CCR4FALL_CCR4FALL_Pos) 
#define  TIM_CCR4FALL_CCR4FALL                    TIM_CCR4FALL_CCR4FALL_Msk                         /*!<Channel x compare value during count down in PWM central alignment mode.PWM phase shift function: Enable PDER register PWM phase shift. According to the required phase shift, configure CCR4FALL and CCRx, PWM exports programmable phase shift waveform, and can shift left or right.*/
#define  TIM_CCR4FALL_CCR4FALL_Bit0               (0x0001U << TIM_CCR4FALL_CCR4FALL_Pos) 
#define  TIM_CCR4FALL_CCR4FALL_Bit1               (0x0002U << TIM_CCR4FALL_CCR4FALL_Pos) 
#define  TIM_CCR4FALL_CCR4FALL_Bit2               (0x0004U << TIM_CCR4FALL_CCR4FALL_Pos) 
#define  TIM_CCR4FALL_CCR4FALL_Bit3               (0x0008U << TIM_CCR4FALL_CCR4FALL_Pos) 
#define  TIM_CCR4FALL_CCR4FALL_Bit4               (0x0010U << TIM_CCR4FALL_CCR4FALL_Pos) 
#define  TIM_CCR4FALL_CCR4FALL_Bit5               (0x0020U << TIM_CCR4FALL_CCR4FALL_Pos) 
#define  TIM_CCR4FALL_CCR4FALL_Bit6               (0x0040U << TIM_CCR4FALL_CCR4FALL_Pos) 
#define  TIM_CCR4FALL_CCR4FALL_Bit7               (0x0080U << TIM_CCR4FALL_CCR4FALL_Pos) 
#define  TIM_CCR4FALL_CCR4FALL_Bit8               (0x0100U << TIM_CCR4FALL_CCR4FALL_Pos) 
#define  TIM_CCR4FALL_CCR4FALL_Bit9               (0x0200U << TIM_CCR4FALL_CCR4FALL_Pos) 
#define  TIM_CCR4FALL_CCR4FALL_Bit10              (0x0400U << TIM_CCR4FALL_CCR4FALL_Pos) 
#define  TIM_CCR4FALL_CCR4FALL_Bit11              (0x0800U << TIM_CCR4FALL_CCR4FALL_Pos) 
#define  TIM_CCR4FALL_CCR4FALL_Bit12              (0x1000U << TIM_CCR4FALL_CCR4FALL_Pos) 
#define  TIM_CCR4FALL_CCR4FALL_Bit13              (0x2000U << TIM_CCR4FALL_CCR4FALL_Pos) 
#define  TIM_CCR4FALL_CCR4FALL_Bit14              (0x4000U << TIM_CCR4FALL_CCR4FALL_Pos) 
#define  TIM_CCR4FALL_CCR4FALL_Bit15              (0x8000U << TIM_CCR4FALL_CCR4FALL_Pos) 
#define  TIM_CCR5FALL_CCR5FALL_Pos                (0)
#define  TIM_CCR5FALL_CCR5FALL_Msk                (0xFFFFU << TIM_CCR5FALL_CCR5FALL_Pos) 
#define  TIM_CCR5FALL_CCR5FALL                    TIM_CCR5FALL_CCR5FALL_Msk                         /*!<Channel x compare value during count down in PWM central alignment mode.PWM phase shift function: Enable PDER register PWM phase shift. According to the required phase shift, configure CCR5FALL and CCRx, PWM exports programmable phase shift waveform, and can shift left or right.*/
#define  TIM_CCR5FALL_CCR5FALL_Bit0               (0x0001U << TIM_CCR5FALL_CCR5FALL_Pos) 
#define  TIM_CCR5FALL_CCR5FALL_Bit1               (0x0002U << TIM_CCR5FALL_CCR5FALL_Pos) 
#define  TIM_CCR5FALL_CCR5FALL_Bit2               (0x0004U << TIM_CCR5FALL_CCR5FALL_Pos) 
#define  TIM_CCR5FALL_CCR5FALL_Bit3               (0x0008U << TIM_CCR5FALL_CCR5FALL_Pos) 
#define  TIM_CCR5FALL_CCR5FALL_Bit4               (0x0010U << TIM_CCR5FALL_CCR5FALL_Pos) 
#define  TIM_CCR5FALL_CCR5FALL_Bit5               (0x0020U << TIM_CCR5FALL_CCR5FALL_Pos) 
#define  TIM_CCR5FALL_CCR5FALL_Bit6               (0x0040U << TIM_CCR5FALL_CCR5FALL_Pos) 
#define  TIM_CCR5FALL_CCR5FALL_Bit7               (0x0080U << TIM_CCR5FALL_CCR5FALL_Pos) 
#define  TIM_CCR5FALL_CCR5FALL_Bit8               (0x0100U << TIM_CCR5FALL_CCR5FALL_Pos) 
#define  TIM_CCR5FALL_CCR5FALL_Bit9               (0x0200U << TIM_CCR5FALL_CCR5FALL_Pos) 
#define  TIM_CCR5FALL_CCR5FALL_Bit10              (0x0400U << TIM_CCR5FALL_CCR5FALL_Pos) 
#define  TIM_CCR5FALL_CCR5FALL_Bit11              (0x0800U << TIM_CCR5FALL_CCR5FALL_Pos) 
#define  TIM_CCR5FALL_CCR5FALL_Bit12              (0x1000U << TIM_CCR5FALL_CCR5FALL_Pos) 
#define  TIM_CCR5FALL_CCR5FALL_Bit13              (0x2000U << TIM_CCR5FALL_CCR5FALL_Pos) 
#define  TIM_CCR5FALL_CCR5FALL_Bit14              (0x4000U << TIM_CCR5FALL_CCR5FALL_Pos) 
#define  TIM_CCR5FALL_CCR5FALL_Bit15              (0x8000U << TIM_CCR5FALL_CCR5FALL_Pos) 

/**
  * @brief TIM_BKINF Register Bit Definition
  */
#define  TIM_BKINF_BKINFE_Pos                     (0)
#define  TIM_BKINF_BKINFE_Msk                     (0x1U << TIM_BKINF_BKINFE_Pos)                    /*!<Break input filter enable*/
#define  TIM_BKINF_BKINFE                         TIM_BKINF_BKINFE_Msk
#define  TIM_BKINF_BKINF_Pos                      (1)
#define  TIM_BKINF_BKINF_Msk                      (0xFU << TIM_BKINF_BKINF_Pos)                     /*!<Break input filter*/
#define  TIM_BKINF_BKINF                          TIM_BKINF_BKINF_Msk
#define  TIM_BKINF_BKINF_Bit0                     (0x1U << TIM_BKINF_BKINF_Pos) 
#define  TIM_BKINF_BKINF_Bit1                     (0x2U << TIM_BKINF_BKINF_Pos) 
#define  TIM_BKINF_BKINF_Bit2                     (0x4U << TIM_BKINF_BKINF_Pos) 
#define  TIM_BKINF_BKINF_Bit3                     (0x8U << TIM_BKINF_BKINF_Pos) 
#define  TIM_BKINF_IOBKIN_SEL_Pos                 (6)
#define  TIM_BKINF_IOBKIN_SEL_Msk                 (0x1U << TIM_BKINF_IOBKIN_SEL_Pos)                /*!<IO break input sel*/
#define  TIM_BKINF_IOBKIN_SEL                     TIM_BKINF_IOBKIN_SEL_Msk
#define  TIM_BKINF_COMPBKIN_SEL_Pos               (13)
#define  TIM_BKINF_COMPBKIN_SEL_Msk               (0x1U << TIM_BKINF_COMPBKIN_SEL_Pos)              /*!<COMP break input sel*/
#define  TIM_BKINF_COMPBKIN_SEL                   TIM_BKINF_COMPBKIN_SEL_Msk

/**
  * @brief TIM_DOCR Register Bit Definition
  */
#define  TIM_DOCR_DOS_Pos                         (0)
#define  TIM_DOCR_DOS_Msk                         (0x3U << TIM_DOCR_DOS_Pos)                        /*!<Debug halt Output select*/
#define  TIM_DOCR_DOS                             TIM_DOCR_DOS_Msk
#define  TIM_DOCR_DOS_Bit0                        (0x1U << TIM_DOCR_DOS_Pos) 
#define  TIM_DOCR_DOS_Bit1                        (0x2U << TIM_DOCR_DOS_Pos) 

/**
  * @brief TIM_SOER Register Bit Definition
  */
#define  TIM_SOER_SOEN_Pos                        (0)
#define  TIM_SOER_SOEN_Msk                        (0x1U << TIM_SOER_SOEN_Pos)                       /*!<Soft Output Enable*/
#define  TIM_SOER_SOEN                            TIM_SOER_SOEN_Msk

/**
  * @brief TIM_SOCR Register Bit Definition
  */
#define  TIM_SOCR_SFTV_Pos                        (0)
#define  TIM_SOCR_SFTV_Msk                        (0xFFU << TIM_SOCR_SFTV_Pos)                      /*!<*/
#define  TIM_SOCR_SFTV                            TIM_SOCR_SFTV_Msk
#define  TIM_SOCR_SFTV_Bit0                       (0x01U << TIM_SOCR_SFTV_Pos) 
#define  TIM_SOCR_SFTV_Bit1                       (0x02U << TIM_SOCR_SFTV_Pos) 
#define  TIM_SOCR_SFTV_Bit2                       (0x04U << TIM_SOCR_SFTV_Pos) 
#define  TIM_SOCR_SFTV_Bit3                       (0x08U << TIM_SOCR_SFTV_Pos) 
#define  TIM_SOCR_SFTV_Bit4                       (0x10U << TIM_SOCR_SFTV_Pos) 
#define  TIM_SOCR_SFTV_Bit5                       (0x20U << TIM_SOCR_SFTV_Pos) 
#define  TIM_SOCR_SFTV_Bit6                       (0x40U << TIM_SOCR_SFTV_Pos) 
#define  TIM_SOCR_SFTV_Bit7                       (0x80U << TIM_SOCR_SFTV_Pos) 
#define  TIM_SOCR_SFTEN_Pos                       (8)
#define  TIM_SOCR_SFTEN_Msk                       (0xFFU << TIM_SOCR_SFTEN_Pos)                     /*!<*/
#define  TIM_SOCR_SFTEN                           TIM_SOCR_SFTEN_Msk
#define  TIM_SOCR_SFTEN_Bit0                      (0x01U << TIM_SOCR_SFTEN_Pos) 
#define  TIM_SOCR_SFTEN_Bit1                      (0x02U << TIM_SOCR_SFTEN_Pos) 
#define  TIM_SOCR_SFTEN_Bit2                      (0x04U << TIM_SOCR_SFTEN_Pos) 
#define  TIM_SOCR_SFTEN_Bit3                      (0x08U << TIM_SOCR_SFTEN_Pos) 
#define  TIM_SOCR_SFTEN_Bit4                      (0x10U << TIM_SOCR_SFTEN_Pos) 
#define  TIM_SOCR_SFTEN_Bit5                      (0x20U << TIM_SOCR_SFTEN_Pos) 
#define  TIM_SOCR_SFTEN_Bit6                      (0x40U << TIM_SOCR_SFTEN_Pos) 
#define  TIM_SOCR_SFTEN_Bit7                      (0x80U << TIM_SOCR_SFTEN_Pos) 
#define  TIM_SOCR_BSFTV_Pos                       (16)
#define  TIM_SOCR_BSFTV_Msk                       (0xFFU << TIM_SOCR_BSFTV_Pos)                     /*!<*/
#define  TIM_SOCR_BSFTV                           TIM_SOCR_BSFTV_Msk
#define  TIM_SOCR_BSFTV_Bit0                      (0x01U << TIM_SOCR_BSFTV_Pos) 
#define  TIM_SOCR_BSFTV_Bit1                      (0x02U << TIM_SOCR_BSFTV_Pos) 
#define  TIM_SOCR_BSFTV_Bit2                      (0x04U << TIM_SOCR_BSFTV_Pos) 
#define  TIM_SOCR_BSFTV_Bit3                      (0x08U << TIM_SOCR_BSFTV_Pos) 
#define  TIM_SOCR_BSFTV_Bit4                      (0x10U << TIM_SOCR_BSFTV_Pos) 
#define  TIM_SOCR_BSFTV_Bit5                      (0x20U << TIM_SOCR_BSFTV_Pos) 
#define  TIM_SOCR_BSFTV_Bit6                      (0x40U << TIM_SOCR_BSFTV_Pos) 
#define  TIM_SOCR_BSFTV_Bit7                      (0x80U << TIM_SOCR_BSFTV_Pos) 
#define  TIM_SOCR_BSFTEN_Pos                      (24)
#define  TIM_SOCR_BSFTEN_Msk                      (0xFFU << TIM_SOCR_BSFTEN_Pos)                    /*!<*/
#define  TIM_SOCR_BSFTEN                          TIM_SOCR_BSFTEN_Msk
#define  TIM_SOCR_BSFTEN_Bit0                     (0x01U << TIM_SOCR_BSFTEN_Pos) 
#define  TIM_SOCR_BSFTEN_Bit1                     (0x02U << TIM_SOCR_BSFTEN_Pos) 
#define  TIM_SOCR_BSFTEN_Bit2                     (0x04U << TIM_SOCR_BSFTEN_Pos) 
#define  TIM_SOCR_BSFTEN_Bit3                     (0x08U << TIM_SOCR_BSFTEN_Pos) 
#define  TIM_SOCR_BSFTEN_Bit4                     (0x10U << TIM_SOCR_BSFTEN_Pos) 
#define  TIM_SOCR_BSFTEN_Bit5                     (0x20U << TIM_SOCR_BSFTEN_Pos) 
#define  TIM_SOCR_BSFTEN_Bit6                     (0x40U << TIM_SOCR_BSFTEN_Pos) 
#define  TIM_SOCR_BSFTEN_Bit7                     (0x80U << TIM_SOCR_BSFTEN_Pos) 

/**
  * @brief TIM_BKSR Register Bit Definition
  */
#define  TIM_BKSR_BIOF_Pos                        (1)
#define  TIM_BKSR_BIOF_Msk                        (0x1U << TIM_BKSR_BIOF_Pos)                       /*!<*/
#define  TIM_BKSR_BIOF                            TIM_BKSR_BIOF_Msk
#define  TIM_BKSR_BCPTF0_Pos                      (2)
#define  TIM_BKSR_BCPTF0_Msk                      (0x1U << TIM_BKSR_BCPTF0_Pos)                     /*!<Debug halt Output select*/
#define  TIM_BKSR_BCPTF0                          TIM_BKSR_BCPTF0_Msk


#endif

